Tekla Open API Reference for Tekla Structures 2025
Brep Constructor
 Initializes a new instance of the Brep class. The start and end points are in the origin.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Brep()
Public Sub New
See Also
Reference
Brep Class
Brep Overload
Tekla.Structures.Model Namespace